chairongzhen/esp32_ledc/src/main.cpp
#include <SPIFFS.h>
#include <WiFi.h>
#include <FS.h>
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <cJSON.h>
#include <time.h>
#include "ESP32Time.h"
#include "LED_ESP32.h"
#include <ESPmDNS.h>
#include <Update.h>

#define RESET_BUTTON 16
#define VERSION_NUM "0.12"
#define ESP_HOST_NAME "esp003"
#define ESP_RTC_TICK 1535987038

String PWM_INFO_SHOWTYPE,PWM_INFO_TESTMODE,PWM_INFO_CONMODE,PWM_INFO_RTC,PWM_INFO_VERSION;
String P1_0, P1_1,P1_2,P1_3,P1_4,P1_5,P1_6,P1_7,P1_8,P1_9,P1_10,P1_11,P1_12,P1_13,P1_14,P1_15,P1_16,P1_17,P1_18,P1_19,P1_20,P1_21,P1_22,P1_23,P1_24;
String P2_0, P2_1,P2_2,P2_3,P2_4,P2_5,P2_6,P2_7,P2_8,P2_9,P2_10,P2_11,P2_12,P2_13,P2_14,P2_15,P2_16,P2_17,P2_18,P2_19,P2_20,P2_21,P2_22,P2_23,P2_24;
String P3_0, P3_1,P3_2,P3_3,P3_4,P3_5,P3_6,P3_7,P3_8,P3_9,P3_10,P3_11,P3_12,P3_13,P3_14,P3_15,P3_16,P3_17,P3_18,P3_19,P3_20,P3_21,P3_22,P3_23,P3_24;
String P4_0, P4_1,P4_2,P4_3,P4_4,P4_5,P4_6,P4_7,P4_8,P4_9,P4_10,P4_11,P4_12,P4_13,P4_14,P4_15,P4_16,P4_17,P4_18,P4_19,P4_20,P4_21,P4_22,P4_23,P4_24;
String P5_0, P5_1,P5_2,P5_3,P5_4,P5_5,P5_6,P5_7,P5_8,P5_9,P5_10,P5_11,P5_12,P5_13,P5_14,P5_15,P5_16,P5_17,P5_18,P5_19,P5_20,P5_21,P5_22,P5_23,P5_24;
String P6_0, P6_1,P6_2,P6_3,P6_4,P6_5,P6_6,P6_7,P6_8,P6_9,P6_10,P6_11,P6_12,P6_13,P6_14,P6_15,P6_16,P6_17,P6_18,P6_19,P6_20,P6_21,P6_22,P6_23,P6_24;
String P7_0, P7_1,P7_2,P7_3,P7_4,P7_5,P7_6,P7_7,P7_8,P7_9,P7_10,P7_11,P7_12,P7_13,P7_14,P7_15,P7_16,P7_17,P7_18,P7_19,P7_20,P7_21,P7_22,P7_23,P7_24;
bool RESET_FLAG = false;

const char* ssid = ESP_HOST_NAME;
const char* password = "11111111";
const char* host = ESP_HOST_NAME;


LED_ESP32 led1(4,0);
LED_ESP32 led2(12,1);
LED_ESP32 led3(13,2);
LED_ESP32 led4(15,3);
LED_ESP32 led5(22,4);
LED_ESP32 led6(23,5);
LED_ESP32 led7(25,6);


String getFileString(fs::FS &fs, const char* path) {
  File file = fs.open(path);
  if(!file) {
    Serial.println("Failed to open file for geting");
    return "";
  }
  return file.readString();
}

void writeFile(fs::FS &fs, const char * path, const char * message) {
  Serial.printf("Writing file: %s\n", path);

  File file = fs.open(path, FILE_WRITE);
  if (!file) {
    Serial.println("Failed to open file for writing");
    return;
  }
  if (file.print(message)) {
    Serial.println("File written");
  } else {
    Serial.println("Write failed");
  }
}

void appendFile(fs::FS &fs, const char * path, const char * message) {
  Serial.printf("Appending to file: %s\n", path);

  File file = fs.open(path, FILE_APPEND);
  if (!file) {
    Serial.println("Failed to open file for appending");
    return;
  }
  if (file.print(message)) {
    Serial.println("Message appended");
  } else {
    Serial.println("Append failed");
  }
}

void appendLn(fs::FS &fs, const char * path) {
  Serial.printf("Appending enter to file: %s\n",path);

  File file = fs.open(path,FILE_APPEND);
  if(!file) {
    Serial.println("Failed to open file for appending");
    return; 
  }
  if(file.println()) {
    Serial.println("Message appended");
  } else {
    Serial.println("Append failed");
  }
}

void deleteFile(fs::FS &fs, const char * path) {
  Serial.printf("Deleting file: %s\n", path);
  if (fs.remove(path)) {
    Serial.println("File deleted");
  } else {
    Serial.println("Delete failed");
  }
}


void initFileSystem() {
  if(SPIFFS.exists("/wifi.ini")) {
    deleteFile(SPIFFS,"/wifi.ini");
  }
  String pwminfocontent = "{\"showtype\":\"fix\",\"testmode\":\"test\",\"sysdate\":\"{unixtick}\",\"status\":\"stop\",\"conmode\": \"local\",\"version\":\"{version_num}\"}";
  pwminfocontent.replace("{version_num}",VERSION_NUM);
  pwminfocontent.replace("{unixtick}",String(ESP_RTC_TICK));
  writeFile(SPIFFS,"/pwminfo.ini",pwminfocontent.c_str());


  writeFile(SPIFFS, "/p1.ini","{\"t0\":0,\"t1\":0,\"t2\":0,\"t3\":0,\"t4\":0,\"t5\":0,\"t6\":0,\"t7\":0,\"t8\":0,\"t9\":0,\"t10\":0,\"t11\":0,\"t12\":0,\"t13\":0,\"t14\":0,\"t15\":0,\"t16\":0,\"t17\":0,\"t18\":0,\"t19\":0,\"t20\":0,\"t21\":0,\"t22\":0,\"t23\":0,\"t24\":0}");
  writeFile(SPIFFS, "/p2.ini","{\"t0\":0,\"t1\":0,\"t2\":0,\"t3\":0,\"t4\":0,\"t5\":0,\"t6\":0,\"t7\":0,\"t8\":0,\"t9\":0,\"t10\":0,\"t11\":0,\"t12\":0,\"t13\":0,\"t14\":0,\"t15\":0,\"t16\":0,\"t17\":0,\"t18\":0,\"t19\":0,\"t20\":0,\"t21\":0,\"t22\":0,\"t23\":0,\"t24\":0}");
  writeFile(SPIFFS, "/p3.ini","{\"t0\":0,\"t1\":0,\"t2\":0,\"t3\":0,\"t4\":0,\"t5\":0,\"t6\":0,\"t7\":0,\"t8\":0,\"t9\":0,\"t10\":0,\"t11\":0,\"t12\":0,\"t13\":0,\"t14\":0,\"t15\":0,\"t16\":0,\"t17\":0,\"t18\":0,\"t19\":0,\"t20\":0,\"t21\":0,\"t22\":0,\"t23\":0,\"t24\":0}");
  writeFile(SPIFFS, "/p4.ini","{\"t0\":0,\"t1\":0,\"t2\":0,\"t3\":0,\"t4\":0,\"t5\":0,\"t6\":0,\"t7\":0,\"t8\":0,\"t9\":0,\"t10\":0,\"t11\":0,\"t12\":0,\"t13\":0,\"t14\":0,\"t15\":0,\"t16\":0,\"t17\":0,\"t18\":0,\"t19\":0,\"t20\":0,\"t21\":0,\"t22\":0,\"t23\":0,\"t24\":0}");
  writeFile(SPIFFS, "/p5.ini","{\"t0\":0,\"t1\":0,\"t2\":0,\"t3\":0,\"t4\":0,\"t5\":0,\"t6\":0,\"t7\":0,\"t8\":0,\"t9\":0,\"t10\":0,\"t11\":0,\"t12\":0,\"t13\":0,\"t14\":0,\"t15\":0,\"t16\":0,\"t17\":0,\"t18\":0,\"t19\":0,\"t20\":0,\"t21\":0,\"t22\":0,\"t23\":0,\"t24\":0}");
  writeFile(SPIFFS, "/p6.ini","{\"t0\":0,\"t1\":0,\"t2\":0,\"t3\":0,\"t4\":0,\"t5\":0,\"t6\":0,\"t7\":0,\"t8\":0,\"t9\":0,\"t10\":0,\"t11\":0,\"t12\":0,\"t13\":0,\"t14\":0,\"t15\":0,\"t16\":0,\"t17\":0,\"t18\":0,\"t19\":0,\"t20\":0,\"t21\":0,\"t22\":0,\"t23\":0,\"t24\":0}");
  writeFile(SPIFFS, "/p7.ini","{\"t0\":0,\"t1\":0,\"t2\":0,\"t3\":0,\"t4\":0,\"t5\":0,\"t6\":0,\"t7\":0,\"t8\":0,\"t9\":0,\"t10\":0,\"t11\":0,\"t12\":0,\"t13\":0,\"t14\":0,\"t15\":0,\"t16\":0,\"t17\":0,\"t18\":0,\"t19\":0,\"t20\":0,\"t21\":0,\"t22\":0,\"t23\":0,\"t24\":0}");
}

void onFileUpload(AsyncWebServerRequest *request, const String& filename, size_t index, uint8_t *data, size_t len, bool final) {
  if(index == 0) {
    Serial.printf("Update: %s\n",filename.c_str());
    if(!Update.begin(UPDATE_SIZE_UNKNOWN)) {
      Update.printError(Serial);
    }
  } 
  Update.write(data,len);  
  if(final) {
    if(Update.end(true)) {
      Serial.printf("Update Success: %u\nRebooting....\n",index+len);
    } else {
      Update.printError(Serial);
    }
  } 
}


void handleRestButtonChanged() {
    Serial.println("Rest begin.....");
    RESET_FLAG = true;
    Serial.println("rest end.....");
    detachInterrupt(RESET_BUTTON);    
}

void notFound(AsyncWebServerRequest *request) {
    request->send(404, "text/plain", "Not found");
}


AsyncWebServer server(80);

void setup() {
  Serial.begin(115200);
  RESET_FLAG = false;
  pinMode(RESET_BUTTON,INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(RESET_BUTTON),handleRestButtonChanged,CHANGE);
  
  WiFi.mode(WIFI_AP_STA);
  WiFi.softAP(ssid,password);
  Serial.println();
  Serial.println("the AP name is : " + String(ssid) + " password is: " + String(password));

  /*use mdns for host name resolution*/
  if (!MDNS.begin(host)) { //http://esp32.local
    Serial.println("Error setting up MDNS responder!");
    while (1) {
      delay(1000);
    }
  }
  Serial.println("mDNS responder started");
  
