chairongzhen/esp32_ledc/src/main.cpp
  led1.setup();
  led2.setup();
  led3.setup();
  led4.setup();
  led5.setup();
  led6.setup();
  led7.setup();

  led1.set(0);
  led2.set(0);
  led3.set(0);
  led4.set(0);
  led5.set(0);
  led6.set(0);
  led7.set(0);


  if (!SPIFFS.begin(true)) {
    Serial.println("SPIFFS Mount Failed");
    return;
  } else {
    if(!SPIFFS.exists("/pwminfo.ini")) {
      Serial.println("begin to init system file");
      initFileSystem();
      Serial.println("init success...");      
    } else {
      Serial.println("not the first time");
      if(SPIFFS.exists("/wifi.ini")) {
        String filestr;
        filestr = getFileString(SPIFFS,"/wifi.ini");
        cJSON* root = NULL;
        cJSON* item = NULL;
        const char* jsonstr = filestr.c_str();
        root = cJSON_Parse(jsonstr);
        String itemstr;
        item = cJSON_GetObjectItem(root,"ssid");
        itemstr = cJSON_Print(item);
        String ssid = itemstr;
        item = cJSON_GetObjectItem(root,"pwd");
        itemstr = cJSON_Print(item);
        String pwd = itemstr;

        ssid.replace("\"","");
        pwd.replace("\"","");
        WiFi.begin(ssid.c_str(),pwd.c_str());
        int i= 30;
        while((WiFi.status() != WL_CONNECTED) && i>0 ) {
          delay(1000);
          Serial.println("Connecting to WiFi");
          i = i-1;
        }
        Serial.println(WiFi.localIP());
      }
      cJSON* root = NULL;
      cJSON* item = NULL;

      String filestr = getFileString(SPIFFS,"/pwminfo.ini");
      const char* jsonstr = filestr.c_str();
      root = cJSON_Parse(jsonstr);
      String itemstr;
      item = cJSON_GetObjectItem(root,"showtype");
      itemstr = cJSON_Print(item);
      PWM_INFO_SHOWTYPE = itemstr;
      PWM_INFO_SHOWTYPE.replace("\"","");

      item = cJSON_GetObjectItem(root,"testmode");
      itemstr = cJSON_Print(item);
      PWM_INFO_TESTMODE = itemstr;
      PWM_INFO_TESTMODE.replace("\"","");

      item = cJSON_GetObjectItem(root,"sysdate");
      itemstr = cJSON_Print(item);
      PWM_INFO_RTC = itemstr;
      PWM_INFO_RTC.replace("\"","");

      struct timeval stime;  
      stime.tv_sec = PWM_INFO_RTC.toInt();
      settimeofday(&stime,NULL);  

      item = cJSON_GetObjectItem(root,"conmode");
      itemstr = cJSON_Print(item);
      PWM_INFO_CONMODE = itemstr;
      PWM_INFO_CONMODE.replace("\"","");

      item = cJSON_GetObjectItem(root,"version");
      itemstr = cJSON_Print(item);
      PWM_INFO_VERSION = itemstr;
      PWM_INFO_VERSION.replace("\"","");

      filestr = getFileString(SPIFFS,"/p1.ini");
      const char* p1json = filestr.c_str();
      root = cJSON_Parse(p1json);
      
      item = cJSON_GetObjectItem(root,"t0");
      itemstr = cJSON_Print(item);
      P1_0 = itemstr;
      P1_0.replace("\"","");
      item = cJSON_GetObjectItem(root,"t1");
      itemstr = cJSON_Print(item);
      P1_1 = itemstr;
      P1_1.replace("\"","");
      item = cJSON_GetObjectItem(root,"t2");
      itemstr = cJSON_Print(item);
      P1_2 = itemstr;
      P1_2.replace("\"","");
      item = cJSON_GetObjectItem(root,"t3");
      itemstr = cJSON_Print(item);
      P1_3 = itemstr;
      P1_3.replace("\"","");
      item = cJSON_GetObjectItem(root,"t4");
      itemstr = cJSON_Print(item);
      P1_4 = itemstr;
      P1_4.replace("\"","");
      item = cJSON_GetObjectItem(root,"t5");
      itemstr = cJSON_Print(item);
      P1_5 = itemstr;
      P1_5.replace("\"","");
      item = cJSON_GetObjectItem(root,"t6");
      itemstr = cJSON_Print(item);
      P1_6 = itemstr;
      P1_6.replace("\"","");
      item = cJSON_GetObjectItem(root,"t7");
      itemstr = cJSON_Print(item);
      P1_7 = itemstr;
      P1_7.replace("\"","");
      item = cJSON_GetObjectItem(root,"t8");
      itemstr = cJSON_Print(item);
      P1_8 = itemstr;
      P1_8.replace("\"","");
      item = cJSON_GetObjectItem(root,"t9");
      itemstr = cJSON_Print(item);
      P1_9 = itemstr;
      P1_9.replace("\"","");
      item = cJSON_GetObjectItem(root,"t10");
      itemstr = cJSON_Print(item);
      P1_10 = itemstr;
      P1_10.replace("\"","");
      item = cJSON_GetObjectItem(root,"t11");
      itemstr = cJSON_Print(item);
      P1_11 = itemstr;
      P1_11.replace("\"","");
      item = cJSON_GetObjectItem(root,"t12");
      itemstr = cJSON_Print(item);
      P1_12 = itemstr;
      P1_12.replace("\"","");
      item = cJSON_GetObjectItem(root,"t13");
      itemstr = cJSON_Print(item);
      P1_13 = itemstr;
      P1_13.replace("\"","");
      item = cJSON_GetObjectItem(root,"t14");
      itemstr = cJSON_Print(item);
      P1_14 = itemstr;
      P1_14.replace("\"","");
      item = cJSON_GetObjectItem(root,"t15");
      itemstr = cJSON_Print(item);
      P1_15 = itemstr;
      P1_15.replace("\"","");
      item = cJSON_GetObjectItem(root,"t16");
      itemstr = cJSON_Print(item);
      P1_16 = itemstr;
      P1_16.replace("\"","");
      item = cJSON_GetObjectItem(root,"t17");
      itemstr = cJSON_Print(item);
      P1_17 = itemstr;
      P1_17.replace("\"","");
      item = cJSON_GetObjectItem(root,"t18");
      itemstr = cJSON_Print(item);
      P1_18 = itemstr;
      P1_18.replace("\"","");
      item = cJSON_GetObjectItem(root,"t19");
      itemstr = cJSON_Print(item);
      P1_19 = itemstr;
      P1_19.replace("\"","");
      item = cJSON_GetObjectItem(root,"t20");
      itemstr = cJSON_Print(item);
      P1_20 = itemstr;
      P1_20.replace("\"","");
      item = cJSON_GetObjectItem(root,"t21");
      itemstr = cJSON_Print(item);
      P1_21 = itemstr;
      P1_21.replace("\"","");
      item = cJSON_GetObjectItem(root,"t22");
      itemstr = cJSON_Print(item);
      P1_22 = itemstr;
      P1_22.replace("\"","");
      item = cJSON_GetObjectItem(root,"t23");
      itemstr = cJSON_Print(item);
      P1_23 = itemstr;
      P1_23.replace("\"","");
      item = cJSON_GetObjectItem(root,"t24");
      itemstr = cJSON_Print(item);
      P1_24 = itemstr;
      P1_24.replace("\"","");      

