chairongzhen/esp32_ledc/src/main.cpp
      filestr = getFileString(SPIFFS,"/p2.ini");
      const char* p2json = filestr.c_str();
      root = cJSON_Parse(p2json);
      
      item = cJSON_GetObjectItem(root,"t0");
      itemstr = cJSON_Print(item);
      P2_0 = itemstr;
      P2_0.replace("\"","");
      item = cJSON_GetObjectItem(root,"t1");
      itemstr = cJSON_Print(item);
      P2_1 = itemstr;
      P2_1.replace("\"","");
      item = cJSON_GetObjectItem(root,"t2");
      itemstr = cJSON_Print(item);
      P2_2 = itemstr;
      P2_2.replace("\"","");
      item = cJSON_GetObjectItem(root,"t3");
      itemstr = cJSON_Print(item);
      P2_3 = itemstr;
      P2_3.replace("\"","");
      item = cJSON_GetObjectItem(root,"t4");
      itemstr = cJSON_Print(item);
      P2_4 = itemstr;
      P2_4.replace("\"","");
      item = cJSON_GetObjectItem(root,"t5");
      itemstr = cJSON_Print(item);
      P2_5 = itemstr;
      P2_5.replace("\"","");
      item = cJSON_GetObjectItem(root,"t6");
      itemstr = cJSON_Print(item);
      P2_6 = itemstr;
      P2_6.replace("\"","");
      item = cJSON_GetObjectItem(root,"t7");
      itemstr = cJSON_Print(item);
      P2_7 = itemstr;
      P2_7.replace("\"","");
      item = cJSON_GetObjectItem(root,"t8");
      itemstr = cJSON_Print(item);
      P2_8 = itemstr;
      P2_8.replace("\"","");
      item = cJSON_GetObjectItem(root,"t9");
      itemstr = cJSON_Print(item);
      P2_9 = itemstr;
      P2_9.replace("\"","");
      item = cJSON_GetObjectItem(root,"t10");
      itemstr = cJSON_Print(item);
      P2_10 = itemstr;
      P2_10.replace("\"","");
      item = cJSON_GetObjectItem(root,"t11");
      itemstr = cJSON_Print(item);
      P2_11 = itemstr;
      P2_11.replace("\"","");
      item = cJSON_GetObjectItem(root,"t12");
      itemstr = cJSON_Print(item);
      P2_12 = itemstr;
      P2_12.replace("\"","");
      item = cJSON_GetObjectItem(root,"t13");
      itemstr = cJSON_Print(item);
      P2_13 = itemstr;
      P2_13.replace("\"","");
      item = cJSON_GetObjectItem(root,"t14");
      itemstr = cJSON_Print(item);
      P2_14 = itemstr;
      P2_14.replace("\"","");
      item = cJSON_GetObjectItem(root,"t15");
      itemstr = cJSON_Print(item);
      P2_15 = itemstr;
      P2_15.replace("\"","");
      item = cJSON_GetObjectItem(root,"t16");
      itemstr = cJSON_Print(item);
      P2_16 = itemstr;
      P2_16.replace("\"","");
      item = cJSON_GetObjectItem(root,"t17");
      itemstr = cJSON_Print(item);
      P2_17 = itemstr;
      P2_17.replace("\"","");
      item = cJSON_GetObjectItem(root,"t18");
      itemstr = cJSON_Print(item);
      P2_18 = itemstr;
      P2_18.replace("\"","");
      item = cJSON_GetObjectItem(root,"t19");
      itemstr = cJSON_Print(item);
      P2_19 = itemstr;
      P2_19.replace("\"","");
      item = cJSON_GetObjectItem(root,"t20");
      itemstr = cJSON_Print(item);
      P2_20 = itemstr;
      P2_20.replace("\"","");
      item = cJSON_GetObjectItem(root,"t21");
      itemstr = cJSON_Print(item);
      P2_21 = itemstr;
      P2_21.replace("\"","");
      item = cJSON_GetObjectItem(root,"t22");
      itemstr = cJSON_Print(item);
      P2_22 = itemstr;
      P2_22.replace("\"","");
      item = cJSON_GetObjectItem(root,"t23");
      itemstr = cJSON_Print(item);
      P2_23 = itemstr;
      P2_23.replace("\"","");
      item = cJSON_GetObjectItem(root,"t24");
      itemstr = cJSON_Print(item);
      P2_24 = itemstr;
      P2_24.replace("\"","");

      filestr = getFileString(SPIFFS,"/p3.ini");
      const char* p3json = filestr.c_str();
      root = cJSON_Parse(p3json);      
      item = cJSON_GetObjectItem(root,"t0");
      itemstr = cJSON_Print(item);
      P3_0 = itemstr;
      P3_0.replace("\"","");
      item = cJSON_GetObjectItem(root,"t1");
      itemstr = cJSON_Print(item);
      P3_1 = itemstr;
      P3_1.replace("\"","");
      item = cJSON_GetObjectItem(root,"t2");
      itemstr = cJSON_Print(item);
      P3_2 = itemstr;
      P3_2.replace("\"","");
      item = cJSON_GetObjectItem(root,"t3");
      itemstr = cJSON_Print(item);
      P3_3 = itemstr;
      P3_3.replace("\"","");
      item = cJSON_GetObjectItem(root,"t4");
      itemstr = cJSON_Print(item);
      P3_4 = itemstr;
      P3_4.replace("\"","");
      item = cJSON_GetObjectItem(root,"t5");
      itemstr = cJSON_Print(item);
      P3_5 = itemstr;
      P3_5.replace("\"","");
      item = cJSON_GetObjectItem(root,"t6");
      itemstr = cJSON_Print(item);
      P3_6 = itemstr;
      P3_6.replace("\"","");
      item = cJSON_GetObjectItem(root,"t7");
      itemstr = cJSON_Print(item);
      P3_7 = itemstr;
      P3_7.replace("\"","");
      item = cJSON_GetObjectItem(root,"t8");
      itemstr = cJSON_Print(item);
      P3_8 = itemstr;
      P3_8.replace("\"","");
      item = cJSON_GetObjectItem(root,"t9");
      itemstr = cJSON_Print(item);
      P3_9 = itemstr;
      P3_9.replace("\"","");
      item = cJSON_GetObjectItem(root,"t10");
      itemstr = cJSON_Print(item);
      P3_10 = itemstr;
      P3_10.replace("\"","");
      item = cJSON_GetObjectItem(root,"t11");
      itemstr = cJSON_Print(item);
      P3_11 = itemstr;
      P3_11.replace("\"","");
      item = cJSON_GetObjectItem(root,"t12");
      itemstr = cJSON_Print(item);
      P3_12 = itemstr;
      P3_12.replace("\"","");
      item = cJSON_GetObjectItem(root,"t13");
      itemstr = cJSON_Print(item);
      P3_13 = itemstr;
      P3_13.replace("\"","");
      item = cJSON_GetObjectItem(root,"t14");
      itemstr = cJSON_Print(item);
      P3_14 = itemstr;
      P3_14.replace("\"","");
      item = cJSON_GetObjectItem(root,"t15");
      itemstr = cJSON_Print(item);
      P3_15 = itemstr;
      P3_15.replace("\"","");
      item = cJSON_GetObjectItem(root,"t16");
      itemstr = cJSON_Print(item);
      P3_16 = itemstr;
      P3_16.replace("\"","");
      item = cJSON_GetObjectItem(root,"t17");
      itemstr = cJSON_Print(item);
      P3_17 = itemstr;
      P3_17.replace("\"","");
      item = cJSON_GetObjectItem(root,"t18");
      itemstr = cJSON_Print(item);
      P3_18 = itemstr;
      P3_18.replace("\"","");
      item = cJSON_GetObjectItem(root,"t19");
      itemstr = cJSON_Print(item);
      P3_19 = itemstr;
      P3_19.replace("\"","");
      item = cJSON_GetObjectItem(root,"t20");
      itemstr = cJSON_Print(item);
      P3_20 = itemstr;
      P3_20.replace("\"","");
      item = cJSON_GetObjectItem(root,"t21");
      itemstr = cJSON_Print(item);
      P3_21 = itemstr;
      P3_21.replace("\"","");
      item = cJSON_GetObjectItem(root,"t22");
      itemstr = cJSON_Print(item);
      P3_22 = itemstr;
      P3_22.replace("\"","");
      item = cJSON_GetObjectItem(root,"t23");
      itemstr = cJSON_Print(item);
      P3_23 = itemstr;
      P3_23.replace("\"","");
      item = cJSON_GetObjectItem(root,"t24");
      itemstr = cJSON_Print(item);
      P3_24 = itemstr;
      P3_24.replace("\"","");

      filestr = getFileString(SPIFFS,"/p4.ini");
      const char* p4json = filestr.c_str();
      root = cJSON_Parse(p4json);
      
