chairongzhen/esp32_ledc/src/main.cpp
      item = cJSON_GetObjectItem(root,"t0");
      itemstr = cJSON_Print(item);
      P4_0 = itemstr;
      P4_0.replace("\"","");
      item = cJSON_GetObjectItem(root,"t1");
      itemstr = cJSON_Print(item);
      P4_1 = itemstr;
      P4_1.replace("\"","");
      item = cJSON_GetObjectItem(root,"t2");
      itemstr = cJSON_Print(item);
      P4_2 = itemstr;
      P4_2.replace("\"","");
      item = cJSON_GetObjectItem(root,"t3");
      itemstr = cJSON_Print(item);
      P4_3 = itemstr;
      P4_3.replace("\"","");
      item = cJSON_GetObjectItem(root,"t4");
      itemstr = cJSON_Print(item);
      P4_4 = itemstr;
      P4_4.replace("\"","");
      item = cJSON_GetObjectItem(root,"t5");
      itemstr = cJSON_Print(item);
      P4_5 = itemstr;
      P4_5.replace("\"","");
      item = cJSON_GetObjectItem(root,"t6");
      itemstr = cJSON_Print(item);
      P4_6 = itemstr;
      P4_6.replace("\"","");
      item = cJSON_GetObjectItem(root,"t7");
      itemstr = cJSON_Print(item);
      P4_7 = itemstr;
      P4_7.replace("\"","");
      item = cJSON_GetObjectItem(root,"t8");
      itemstr = cJSON_Print(item);
      P4_8 = itemstr;
      P4_8.replace("\"","");
      item = cJSON_GetObjectItem(root,"t9");
      itemstr = cJSON_Print(item);
      P4_9 = itemstr;
      P4_9.replace("\"","");
      item = cJSON_GetObjectItem(root,"t10");
      itemstr = cJSON_Print(item);
      P4_10 = itemstr;
      P4_10.replace("\"","");
      item = cJSON_GetObjectItem(root,"t11");
      itemstr = cJSON_Print(item);
      P4_11 = itemstr;
      P4_11.replace("\"","");
      item = cJSON_GetObjectItem(root,"t12");
      itemstr = cJSON_Print(item);
      P4_12 = itemstr;
      P4_12.replace("\"","");
      item = cJSON_GetObjectItem(root,"t13");
      itemstr = cJSON_Print(item);
      P4_13 = itemstr;
      P4_13.replace("\"","");
      item = cJSON_GetObjectItem(root,"t14");
      itemstr = cJSON_Print(item);
      P4_14 = itemstr;
      P4_14.replace("\"","");
      item = cJSON_GetObjectItem(root,"t15");
      itemstr = cJSON_Print(item);
      P4_15 = itemstr;
      P4_15.replace("\"","");
      item = cJSON_GetObjectItem(root,"t16");
      itemstr = cJSON_Print(item);
      P4_16 = itemstr;
      P4_16.replace("\"","");
      item = cJSON_GetObjectItem(root,"t17");
      itemstr = cJSON_Print(item);
      P4_17 = itemstr;
      P4_17.replace("\"","");
      item = cJSON_GetObjectItem(root,"t18");
      itemstr = cJSON_Print(item);
      P4_18 = itemstr;
      P4_18.replace("\"","");
      item = cJSON_GetObjectItem(root,"t19");
      itemstr = cJSON_Print(item);
      P4_19 = itemstr;
      P4_19.replace("\"","");
      item = cJSON_GetObjectItem(root,"t20");
      itemstr = cJSON_Print(item);
      P4_20 = itemstr;
      P4_20.replace("\"","");
      item = cJSON_GetObjectItem(root,"t21");
      itemstr = cJSON_Print(item);
      P4_21 = itemstr;
      P4_21.replace("\"","");
      item = cJSON_GetObjectItem(root,"t22");
      itemstr = cJSON_Print(item);
      P4_22 = itemstr;
      P4_22.replace("\"","");
      item = cJSON_GetObjectItem(root,"t23");
      itemstr = cJSON_Print(item);
      P4_23 = itemstr;
      P4_23.replace("\"","");
      item = cJSON_GetObjectItem(root,"t24");
      itemstr = cJSON_Print(item);
      P4_24 = itemstr;
      P4_24.replace("\"","");

      filestr = getFileString(SPIFFS,"/p5.ini");
      const char* p5json = filestr.c_str();
      root = cJSON_Parse(p5json);
      
      item = cJSON_GetObjectItem(root,"t0");
      itemstr = cJSON_Print(item);
      P5_0 = itemstr;
      P5_0.replace("\"","");
      item = cJSON_GetObjectItem(root,"t1");
      itemstr = cJSON_Print(item);
      P5_1 = itemstr;
      P5_1.replace("\"","");
      item = cJSON_GetObjectItem(root,"t2");
      itemstr = cJSON_Print(item);
      P5_2 = itemstr;
      P5_2.replace("\"","");
      item = cJSON_GetObjectItem(root,"t3");
      itemstr = cJSON_Print(item);
      P5_3 = itemstr;
      P5_3.replace("\"","");
      item = cJSON_GetObjectItem(root,"t4");
      itemstr = cJSON_Print(item);
      P5_4 = itemstr;
      P5_4.replace("\"","");
      item = cJSON_GetObjectItem(root,"t5");
      itemstr = cJSON_Print(item);
      P5_5 = itemstr;
      P5_5.replace("\"","");
      item = cJSON_GetObjectItem(root,"t6");
      itemstr = cJSON_Print(item);
      P5_6 = itemstr;
      P5_6.replace("\"","");
      item = cJSON_GetObjectItem(root,"t7");
      itemstr = cJSON_Print(item);
      P5_7 = itemstr;
      P5_7.replace("\"","");
      item = cJSON_GetObjectItem(root,"t8");
      itemstr = cJSON_Print(item);
      P5_8 = itemstr;
      P5_8.replace("\"","");
      item = cJSON_GetObjectItem(root,"t9");
      itemstr = cJSON_Print(item);
      P5_9 = itemstr;
      P5_9.replace("\"","");
      item = cJSON_GetObjectItem(root,"t10");
      itemstr = cJSON_Print(item);
      P5_10 = itemstr;
      P5_10.replace("\"","");
      item = cJSON_GetObjectItem(root,"t11");
      itemstr = cJSON_Print(item);
      P5_11 = itemstr;
      P5_11.replace("\"","");
      item = cJSON_GetObjectItem(root,"t12");
      itemstr = cJSON_Print(item);
      P5_12 = itemstr;
      P5_12.replace("\"","");
      item = cJSON_GetObjectItem(root,"t13");
      itemstr = cJSON_Print(item);
      P5_13 = itemstr;
      P5_13.replace("\"","");
      item = cJSON_GetObjectItem(root,"t14");
      itemstr = cJSON_Print(item);
      P5_14 = itemstr;
      P5_14.replace("\"","");
      item = cJSON_GetObjectItem(root,"t15");
      itemstr = cJSON_Print(item);
      P5_15 = itemstr;
      P5_15.replace("\"","");
      item = cJSON_GetObjectItem(root,"t16");
      itemstr = cJSON_Print(item);
      P5_16 = itemstr;
      P5_16.replace("\"","");
      item = cJSON_GetObjectItem(root,"t17");
      itemstr = cJSON_Print(item);
      P5_17 = itemstr;
      P5_17.replace("\"","");
      item = cJSON_GetObjectItem(root,"t18");
      itemstr = cJSON_Print(item);
      P5_18 = itemstr;
      P5_18.replace("\"","");
      item = cJSON_GetObjectItem(root,"t19");
      itemstr = cJSON_Print(item);
      P5_19 = itemstr;
      P5_19.replace("\"","");
      item = cJSON_GetObjectItem(root,"t20");
      itemstr = cJSON_Print(item);
      P5_20 = itemstr;
      P5_20.replace("\"","");
      item = cJSON_GetObjectItem(root,"t21");
      itemstr = cJSON_Print(item);
      P5_21 = itemstr;
      P5_21.replace("\"","");
      item = cJSON_GetObjectItem(root,"t22");
      itemstr = cJSON_Print(item);
      P5_22 = itemstr;
      P5_22.replace("\"","");
      item = cJSON_GetObjectItem(root,"t23");
      itemstr = cJSON_Print(item);
      P5_23 = itemstr;
      P5_23.replace("\"","");
      item = cJSON_GetObjectItem(root,"t24");
      itemstr = cJSON_Print(item);
      P5_24 = itemstr;
      P5_24.replace("\"",""); 

      filestr = getFileString(SPIFFS,"/p6.ini");
      const char* p6json = filestr.c_str();
      root = cJSON_Parse(p6json);
      
