chairongzhen/esp32_ledc/src/main.cpp
      item = cJSON_GetObjectItem(root,"t0");
      itemstr = cJSON_Print(item);
      P6_0 = itemstr;
      P6_0.replace("\"","");
      item = cJSON_GetObjectItem(root,"t1");
      itemstr = cJSON_Print(item);
      P6_1 = itemstr;
      P6_1.replace("\"","");
      item = cJSON_GetObjectItem(root,"t2");
      itemstr = cJSON_Print(item);
      P6_2 = itemstr;
      P6_2.replace("\"","");
      item = cJSON_GetObjectItem(root,"t3");
      itemstr = cJSON_Print(item);
      P6_3 = itemstr;
      P6_3.replace("\"","");
      item = cJSON_GetObjectItem(root,"t4");
      itemstr = cJSON_Print(item);
      P6_4 = itemstr;
      P6_4.replace("\"","");
      item = cJSON_GetObjectItem(root,"t5");
      itemstr = cJSON_Print(item);
      P6_5 = itemstr;
      P6_5.replace("\"","");
      item = cJSON_GetObjectItem(root,"t6");
      itemstr = cJSON_Print(item);
      P6_6 = itemstr;
      P6_6.replace("\"","");
      item = cJSON_GetObjectItem(root,"t7");
      itemstr = cJSON_Print(item);
      P6_7 = itemstr;
      P6_7.replace("\"","");
      item = cJSON_GetObjectItem(root,"t8");
      itemstr = cJSON_Print(item);
      P6_8 = itemstr;
      P6_8.replace("\"","");
      item = cJSON_GetObjectItem(root,"t9");
      itemstr = cJSON_Print(item);
      P6_9 = itemstr;
      P6_9.replace("\"","");
      item = cJSON_GetObjectItem(root,"t10");
      itemstr = cJSON_Print(item);
      P6_10 = itemstr;
      P6_10.replace("\"","");
      item = cJSON_GetObjectItem(root,"t11");
      itemstr = cJSON_Print(item);
      P6_11 = itemstr;
      P6_11.replace("\"","");
      item = cJSON_GetObjectItem(root,"t12");
      itemstr = cJSON_Print(item);
      P6_12 = itemstr;
      P6_12.replace("\"","");
      item = cJSON_GetObjectItem(root,"t13");
      itemstr = cJSON_Print(item);
      P6_13 = itemstr;
      P6_13.replace("\"","");
      item = cJSON_GetObjectItem(root,"t14");
      itemstr = cJSON_Print(item);
      P6_14 = itemstr;
      P6_14.replace("\"","");
      item = cJSON_GetObjectItem(root,"t15");
      itemstr = cJSON_Print(item);
      P6_15 = itemstr;
      P6_15.replace("\"","");
      item = cJSON_GetObjectItem(root,"t16");
      itemstr = cJSON_Print(item);
      P6_16 = itemstr;
      P6_16.replace("\"","");
      item = cJSON_GetObjectItem(root,"t17");
      itemstr = cJSON_Print(item);
      P6_17 = itemstr;
      P6_17.replace("\"","");
      item = cJSON_GetObjectItem(root,"t18");
      itemstr = cJSON_Print(item);
      P6_18 = itemstr;
      P6_18.replace("\"","");
      item = cJSON_GetObjectItem(root,"t19");
      itemstr = cJSON_Print(item);
      P6_19 = itemstr;
      P6_19.replace("\"","");
      item = cJSON_GetObjectItem(root,"t20");
      itemstr = cJSON_Print(item);
      P6_20 = itemstr;
      P6_20.replace("\"","");
      item = cJSON_GetObjectItem(root,"t21");
      itemstr = cJSON_Print(item);
      P6_21 = itemstr;
      P6_21.replace("\"","");
      item = cJSON_GetObjectItem(root,"t22");
      itemstr = cJSON_Print(item);
      P6_22 = itemstr;
      P6_22.replace("\"","");
      item = cJSON_GetObjectItem(root,"t23");
      itemstr = cJSON_Print(item);
      P6_23 = itemstr;
      P6_23.replace("\"","");
      item = cJSON_GetObjectItem(root,"t24");
      itemstr = cJSON_Print(item);
      P6_24 = itemstr;
      P6_24.replace("\"",""); 

      filestr = getFileString(SPIFFS,"/p7.ini");
      const char* p7json = filestr.c_str();
      root = cJSON_Parse(p7json);
      
      item = cJSON_GetObjectItem(root,"t0");
      itemstr = cJSON_Print(item);
      P7_0 = itemstr;
      P7_0.replace("\"","");
      item = cJSON_GetObjectItem(root,"t1");
      itemstr = cJSON_Print(item);
      P7_1 = itemstr;
      P7_1.replace("\"","");
      item = cJSON_GetObjectItem(root,"t2");
      itemstr = cJSON_Print(item);
      P7_2 = itemstr;
      P7_2.replace("\"","");
      item = cJSON_GetObjectItem(root,"t3");
      itemstr = cJSON_Print(item);
      P7_3 = itemstr;
      P7_3.replace("\"","");
      item = cJSON_GetObjectItem(root,"t4");
      itemstr = cJSON_Print(item);
      P7_4 = itemstr;
      P7_4.replace("\"","");
      item = cJSON_GetObjectItem(root,"t5");
      itemstr = cJSON_Print(item);
      P7_5 = itemstr;
      P7_5.replace("\"","");
      item = cJSON_GetObjectItem(root,"t6");
      itemstr = cJSON_Print(item);
      P7_6 = itemstr;
      P7_6.replace("\"","");
      item = cJSON_GetObjectItem(root,"t7");
      itemstr = cJSON_Print(item);
      P7_7 = itemstr;
      P7_7.replace("\"","");
      item = cJSON_GetObjectItem(root,"t8");
      itemstr = cJSON_Print(item);
      P7_8 = itemstr;
      P7_8.replace("\"","");
      item = cJSON_GetObjectItem(root,"t9");
      itemstr = cJSON_Print(item);
      P7_9 = itemstr;
      P7_9.replace("\"","");
      item = cJSON_GetObjectItem(root,"t10");
      itemstr = cJSON_Print(item);
      P7_10 = itemstr;
      P7_10.replace("\"","");
      item = cJSON_GetObjectItem(root,"t11");
      itemstr = cJSON_Print(item);
      P7_11 = itemstr;
      P7_11.replace("\"","");
      item = cJSON_GetObjectItem(root,"t12");
      itemstr = cJSON_Print(item);
      P7_12 = itemstr;
      P7_12.replace("\"","");
      item = cJSON_GetObjectItem(root,"t13");
      itemstr = cJSON_Print(item);
      P7_13 = itemstr;
      P7_13.replace("\"","");
      item = cJSON_GetObjectItem(root,"t14");
      itemstr = cJSON_Print(item);
      P7_14 = itemstr;
      P7_14.replace("\"","");
      item = cJSON_GetObjectItem(root,"t15");
      itemstr = cJSON_Print(item);
      P7_15 = itemstr;
      P7_15.replace("\"","");
      item = cJSON_GetObjectItem(root,"t16");
      itemstr = cJSON_Print(item);
      P7_16 = itemstr;
      P7_16.replace("\"","");
      item = cJSON_GetObjectItem(root,"t17");
      itemstr = cJSON_Print(item);
      P7_17 = itemstr;
      P7_17.replace("\"","");
      item = cJSON_GetObjectItem(root,"t18");
      itemstr = cJSON_Print(item);
      P7_18 = itemstr;
      P7_18.replace("\"","");
      item = cJSON_GetObjectItem(root,"t19");
      itemstr = cJSON_Print(item);
      P7_19 = itemstr;
      P7_19.replace("\"","");
      item = cJSON_GetObjectItem(root,"t20");
      itemstr = cJSON_Print(item);
      P7_20 = itemstr;
      P7_20.replace("\"","");
      item = cJSON_GetObjectItem(root,"t21");
      itemstr = cJSON_Print(item);
      P7_21 = itemstr;
      P7_21.replace("\"","");
      item = cJSON_GetObjectItem(root,"t22");
      itemstr = cJSON_Print(item);
      P7_22 = itemstr;
      P7_22.replace("\"","");
      item = cJSON_GetObjectItem(root,"t23");
      itemstr = cJSON_Print(item);
      P7_23 = itemstr;
      P7_23.replace("\"","");
      item = cJSON_GetObjectItem(root,"t24");
      itemstr = cJSON_Print(item);
      P7_24 = itemstr;
      P7_24.replace("\"","");                                  
    }
  }

  SPIFFS.end();

  ESP32Time.begin();

  server.on("/",HTTP_GET,[](AsyncWebServerRequest *request){    
    if (!SPIFFS.begin()) {
        Serial.println("SPIFFS Mount Failed");
        return;
    }
    String filestr;
    filestr = getFileString(SPIFFS,"/pwminfo.ini");
    cJSON* root = NULL;
    cJSON* item = NULL;
    const char* jsonstr = filestr.c_str();
    root = cJSON_Parse(jsonstr);

    String itemstr;
    item = cJSON_GetObjectItem(root,"showtype");
    itemstr = cJSON_Print(item);
    String showtype = itemstr;
    item = cJSON_GetObjectItem(root,"testmode");
    itemstr = cJSON_Print(item);
    String testmode = itemstr;
    item = cJSON_GetObjectItem(root,"sysdate");
    itemstr = cJSON_Print(item);
    String sysdate = itemstr;
    sysdate.replace("\"","");
    item = cJSON_GetObjectItem(root,"status");
    itemstr = cJSON_Print(item);
    String status = itemstr;
    item = cJSON_GetObjectItem(root,"conmode");
    itemstr = cJSON_Print(item);
    String conmode = itemstr;
    item = cJSON_GetObjectItem(root,"version");
    itemstr = cJSON_Print(item);
    String version = itemstr;
    version.replace("\"","");


    String html = "";
    html = html + "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"UTF-8\"><title>NodeMCU Control Page</title><!--<script type=\"text/javascript\"src=\"jquery.js\"></script>--></head><body><div><h1 id=\"title\">基本信息</h1><table><tr><th style=\"text-align:left;\">版本号</th></tr><tr><td><span id=\"spversion\"></span></td></tr><tr><th style=\"text-align:left;\">系统时间</th></tr><tr><td><span id=\"spCurrent\"></span></td></tr><tr><th style=\"text-align: left;\">修改时间</th></tr><tr><td><input type=\"text\"value=\"2018-03-03 00:00:00\"id=\"txtsysdate\"/>*时间格式:2018-03-03 00:00:00</td></tr><tr><th style=\"text-align:left;\">循环模式</th></tr><tr><td><input type=\"radio\"value=\"repeat\"name=\"showtype\"id=\"rdRpt\"/>循环模式<input type=\"radio\"value=\"fix\"name=\"showtype\"id=\"rdFix\"/>固定模式</td></tr><tr id=\"thtest\"><th style=\"text-align:left;\">是否测试</th></tr><tr id=\"tdtest\"><td><input value=\"production\"type=\"radio\"name=\"testMode\"id=\"rdPrd\"/>否<input value=\"test\"type=\"radio\"name=\"testMode\"id=\"rdTest\"/>是</td></tr><tr id=\"thonline\"><th style=\"text-align:left;\">云端控制</th></tr><tr id=\"tdonline\"><td><input value=\"local\"type=\"radio\"name=\"onlineMode\"id=\"rdlocal\"/>否<input value=\"online\"type=\"radio\"name=\"onlineMode\"id=\"rdonline\"/>是</td></tr><tr><td><input type=\"button\"value=\"联网设置\"id=\"btnwifi\"onclick=\"wifi();\"/><input type=\"submit\"value=\"保存\"id=\"submit\"onclick=\"submit();\"/><input type=\"button\"value=\"恢复出厂\"id=\"btnstop\"onclick=\"init();\"/><input type=\"button\"value=\"重启\"id=\"btnReset\"onclick=\"reset();\"/><input type=\"button\"value=\"更新固件\"id=\"btnupload\"onclick=\"upload();\"/></td></tr></table><hr/><h1 id=\"title\">灯光控制</h1><table><tr><th>第一排</th><th>第二排</th><th>第三排</th><th>第四排</th><th>第五排</th><th>第六排</th><th>第七排</th></tr><tr><td><a href=\"/p?mode=p1\">查看/修改</a></td><td><a href=\"/p?mode=p2\">查看/修改</a></td><td><a href=\"/p?mode=p3\">查看/修改</a></td><td><a href=\"/p?mode=p4\">查看/修改</a></td><td><a href=\"/p?mode=p5\">查看/修改</a></td><td><a href=\"/p?mode=p6\">查看/修改</a></td><td><a href=\"/p?mode=p7\">查看/修改</a></td></tr></table></div><script>function submit(){var selectshowtype=document.getElementsByName('showtype');var showtypevalue=\"\";for(var i=0;i<selectshowtype.length;i++){if(selectshowtype[i].checked){showtypevalue=selectshowtype[i].value;break}}var selecttestmode=document.getElementsByName('testMode');var testmodevalue=\"\";for(var i=0;i<selecttestmode.length;i++){if(selecttestmode[i].checked){testmodevalue=selecttestmode[i].value;break}}var str=document.getElementById('txtsysdate').value;str=str.replace(/-/g,\"/\");var date=new Date(str);var humanDate=new Date(Date.UTC(date.getFullYear(),date.getMonth(),date.getDate(),date.getHours(),date.getMinutes(),date.getSeconds()));var unixDate=humanDate.getTime()/1000;var selectedconnectionmode=document.getElementsByName(\"onlineMode\");var connectionmodevalue=\"\";for(var i=0;i<selectedconnectionmode.length;i++){if(selectedconnectionmode[i].checked){connectionmodevalue=selectedconnectionmode[i].value;break}}alert('保存成功');var url=\"pwmopr?showtype=\"+showtypevalue+\"&testmode=\"+testmodevalue+\"&sysdate=\"+unixDate+\"&conmode=\"+connectionmodevalue;window.location.href=url}function init(){alert('已恢复出厂设置!');var url=\"init\";window.location.href=url}function wifi(){var url=\"wifi\";window.location.href=url}function reset(){var url=\"reset\";alert(\"已重启,请关闭当前页面\");window.location.href=url}function upload(){var url=\"upload\";window.location.href=url}</script></body></html>";
    String tpl_currentdate = "<span id=\"spCurrent\"></span>";
    String change_currentdate = "<span id=\"spCurrent\">";
        
