chairongzhen/esp32_ledc/src/main.cpp
    time_t t = time(NULL);
    struct tm *t_st;
    t_st = localtime(&t);
    char nowtime[24];
    memset(nowtime,0,sizeof(nowtime));
    strftime(nowtime,24,"%Y-%m-%d %H:%M:%S",t_st);
    String strDate = nowtime;
    change_currentdate = change_currentdate + strDate;
    change_currentdate = change_currentdate + "</span>";  
    html.replace(tpl_currentdate,change_currentdate);
    
    String tpl_txtcurrentdate = "<input type=\"text\"value=\"2018-03-03 00:00:00\"id=\"txtsysdate\"/>";
    String change_txtcurrentdate = "<input type=\"text\"value=\"";
    change_txtcurrentdate = change_txtcurrentdate + strDate;
    change_txtcurrentdate = change_txtcurrentdate + "\"id=\"txtsysdate\"/>";
    html.replace(tpl_txtcurrentdate,change_txtcurrentdate);

    String tpl_cyclemode = "<input type=\"radio\"value=\"repeat\"name=\"showtype\"id=\"rdRpt\"/>";
    String tpl_fixmode = "<input type=\"radio\"value=\"fix\"name=\"showtype\"id=\"rdFix\"/>";
    String change_runtype;
    if(showtype == "\"repeat\"") {
      change_runtype = "<input type=\"radio\"value=\"repeat\"name=\"showtype\"id=\"rdRpt\" checked/>";
      html.replace(tpl_cyclemode,change_runtype);
    } else if(showtype == "\"fix\"") {
      change_runtype = "<input type=\"radio\"value=\"fix\"name=\"showtype\"id=\"rdFix\" checked/>";
      html.replace(tpl_fixmode,change_runtype);
    }

    String tpl_prodmode = "<input value=\"production\"type=\"radio\"name=\"testMode\"id=\"rdPrd\"/>";
    String tpl_testmode = "<input value=\"test\"type=\"radio\"name=\"testMode\"id=\"rdTest\"/>";
    String change_protype;
    if(testmode == "\"production\"") {
      change_protype = "<input value=\"production\"type=\"radio\"name=\"testMode\"id=\"rdPrd\" checked/>";
      html.replace(tpl_prodmode,change_protype);
    } else if(testmode == "\"test\"") {
      change_protype = "<input value=\"test\"type=\"radio\"name=\"testMode\"id=\"rdTest\" checked/>";
      html.replace(tpl_testmode,change_protype);
    }

    String tpl_oninemode = "<input value=\"online\"type=\"radio\"name=\"onlineMode\"id=\"rdonline\"/>";
    String tpl_localmode = "<input value=\"local\"type=\"radio\"name=\"onlineMode\"id=\"rdlocal\"/>";
    String Change_connectiontype;
    if(conmode == "\"online\"") {
      Change_connectiontype = "<input value=\"online\"type=\"radio\"name=\"onlineMode\"id=\"rdonline\" checked/>";
      html.replace(tpl_oninemode,Change_connectiontype);
    } else if(conmode == "\"local\"") {
      Change_connectiontype = "<input value=\"local\"type=\"radio\"name=\"onlineMode\"id=\"rdlocal\" checked/>";
      html.replace(tpl_localmode,Change_connectiontype);
    }

    String tpl_version = "<span id=\"spversion\"></span>";
    String change_version = "<span id=\"spversion\">";
    change_version = change_version + version;
    change_version = change_version + "</span>";
    html.replace(tpl_version,change_version);

    request->send(200,"text/html",html);
  });

  server.on("/p",HTTP_GET,[](AsyncWebServerRequest *request){
    String lightSeq;
    String html = "";
    if(request->hasParam("mode")) {      
      if (!SPIFFS.begin()) {
        Serial.println("SPIFFS Mount Failed");
        return;
      }
      lightSeq = request->getParam("mode")->value();
      String filestr;
      //filestr = getFileString(SPIFFS,"/pwminfo.ini");
      

      if(lightSeq == "p1") {
        filestr = getFileString(SPIFFS,"/p1.ini");
      } else if(lightSeq == "p2") {
        filestr = getFileString(SPIFFS,"/p2.ini");
      } else if(lightSeq == "p3") {
        filestr = getFileString(SPIFFS,"/p3.ini");
      } else if(lightSeq == "p4") {
        filestr = getFileString(SPIFFS,"/p4.ini");
      } else if(lightSeq == "p5") {
        filestr = getFileString(SPIFFS,"/p5.ini");
      } else if(lightSeq == "p6") {
        filestr = getFileString(SPIFFS,"/p6.ini");
      } else if(lightSeq == "p7") {
        filestr = getFileString(SPIFFS,"/p7.ini");
      }

      cJSON* root = NULL;
      cJSON* item = NULL;
      const char* jsonstr = filestr.c_str();
      root = cJSON_Parse(jsonstr);

      if(!root) {
        Serial.println("Error occured");
      } else {
        //String lid;  
        String rawhtml = "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"UTF-8\"><title>操作</title></head><body><h1><span id=\"sptitle\">亮度操作</span></h1><Table><tr><th>0点</th><th>1点</th><th>2点</th><th>3点</th><th>4点</th><th>5点</th></tr><tr><td><input type=\"text\"width=\"50\"id=\"txtl0\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl1\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl2\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl3\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl4\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl5\"/></td></tr><tr><th>6点</th><th>7点</th><th>8点</th><th>9点</th><th>10点</th><th>11点</th></tr><tr><td><input type=\"text\"width=\"50\"id=\"txtl6\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl7\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl8\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl9\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl10\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl11\"/></td></tr><tr><th>12点</th><th>13点</th><th>14点</th><th>15点</th><th>16点</th><th>17点</th></tr><tr><td><input type=\"text\"width=\"50\"id=\"txtl12\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl13\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl14\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl15\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl16\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl17\"/></td></tr><tr><th>18点</th><th>19点</th><th>20点</th><th>21点</th><th>22点</th><th>23点</th></tr><tr><td><input type=\"text\"width=\"50\"id=\"txtl18\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl19\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl20\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl21\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl22\"/></td><td><input type=\"text\"width=\"50\"id=\"txtl23\"/></td></tr><tr><th>固定</th></tr><tr><td><input type=\"text\"width=\"50\"id=\"txtl24\"/></td></tr><tr><td><input onclick=\"submit();\"type=\"submit\"id=\"submit\"value=\"保存\"/><input onclick=\"back();\"type=\"button\"id=\"btnback\"value=\"返回\"/></td></tr><tr><td sylte=\"color:red\">取值范围0~255</td></tr></Table></body><script language=\"javascript\">function submit(){var t0=document.getElementById(\"txtl0\").value;var t1=document.getElementById(\"txtl1\").value;var t2=document.getElementById(\"txtl2\").value;var t3=document.getElementById(\"txtl3\").value;var t4=document.getElementById(\"txtl4\").value;var t5=document.getElementById(\"txtl5\").value;var t6=document.getElementById(\"txtl6\").value;var t7=document.getElementById(\"txtl7\").value;var t8=document.getElementById(\"txtl8\").value;var t9=document.getElementById(\"txtl9\").value;var t10=document.getElementById(\"txtl10\").value;var t11=document.getElementById(\"txtl11\").value;var t12=document.getElementById(\"txtl12\").value;var t13=document.getElementById(\"txtl13\").value;var t14=document.getElementById(\"txtl14\").value;var t15=document.getElementById(\"txtl15\").value;var t16=document.getElementById(\"txtl16\").value;var t17=document.getElementById(\"txtl17\").value;var t18=document.getElementById(\"txtl18\").value;var t19=document.getElementById(\"txtl19\").value;var t20=document.getElementById(\"txtl20\").value;var t21=document.getElementById(\"txtl21\").value;var t22=document.getElementById(\"txtl22\").value;var t23=document.getElementById(\"txtl23\").value;var t24=document.getElementById(\"txtl24\").value;var mode=document.getElementById(\"sptitle\").innerHTML;var url=\"setp?mode=\"+mode+\"&t0=\"+t0+\"&t1=\"+t1+\"&t2=\"+t2+\"&t3=\"+t3+\"&t4=\"+t4+\"&t5=\"+t5+\"&t6=\"+t6+\"&t7=\"+t7+\"&t8=\"+t8+\"&t9=\"+t9+\"&t10=\"+t10+\"&t11=\"+t11+\"&t12=\"+t12+\"&t13=\"+t13+\"&t14=\"+t14+\"&t15=\"+t15+\"&t16=\"+t16+\"&t17=\"+t17+\"&t18=\"+t18+\"&t19=\"+t19+\"&t20=\"+t20+\"&t21=\"+t21+\"&t22=\"+t22+\"&t23=\"+t23+\"&t24=\"+t24;alert('保存成功');window.location.href=url}function back(){var url=\"/\";window.location.href=url}</script></html>";
        String tpl_data = "<input type=\"text\"width=\"50\"id=\"txtl{lid}\"/>";
        String itemstr;
        String changeinput;
        
