chairongzhen/esp32_ledc/src/main.cpp
        String tpl_title = "<span id=\"sptitle\">亮度操作</span>";
        String chang_title = "<span id=\"sptitle\">" + lightSeq + "</span>";
        rawhtml.replace(tpl_title,chang_title);

        item = cJSON_GetObjectItem(root,"t0");
        itemstr = cJSON_Print(item);
        String t0txt = tpl_data;
        t0txt.replace("{lid}","0");
        changeinput = t0txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t0txt,changeinput);

        item = cJSON_GetObjectItem(root,"t1");
        itemstr = cJSON_Print(item);
        String t1txt = tpl_data; 
        t1txt.replace("{lid}","1");
        changeinput = t1txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t1txt,changeinput);

        item = cJSON_GetObjectItem(root,"t2");
        itemstr = cJSON_Print(item);
        String t2txt = tpl_data; 
        t2txt.replace("{lid}","2");
        changeinput = t2txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t2txt,changeinput);

        item = cJSON_GetObjectItem(root,"t3");
        itemstr = cJSON_Print(item);
        String t3txt = tpl_data; 
        t3txt.replace("{lid}","3");
        changeinput = t3txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t3txt,changeinput);

        item = cJSON_GetObjectItem(root,"t4");
        itemstr = cJSON_Print(item);
        String t4txt = tpl_data; 
        t4txt.replace("{lid}","4");
        changeinput = t4txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t4txt,changeinput);

        item = cJSON_GetObjectItem(root,"t5");
        itemstr = cJSON_Print(item);
        String t5txt = tpl_data; 
        t5txt.replace("{lid}","5");
        changeinput = t5txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t5txt,changeinput);

        item = cJSON_GetObjectItem(root,"t6");
        itemstr = cJSON_Print(item);
        String t6txt = tpl_data; 
        t6txt.replace("{lid}","6");
        changeinput = t6txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t6txt,changeinput);

        item = cJSON_GetObjectItem(root,"t7");
        itemstr = cJSON_Print(item);
        String t7txt = tpl_data;
        t7txt.replace("{lid}","7");
        changeinput = t7txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t7txt,changeinput);

        item = cJSON_GetObjectItem(root,"t8");
        itemstr = cJSON_Print(item);
        String t8txt = tpl_data; 
        t8txt.replace("{lid}","8");
        changeinput = t8txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t8txt,changeinput);

        item = cJSON_GetObjectItem(root,"t9");
        itemstr = cJSON_Print(item);
        String t9txt = tpl_data; 
        t9txt.replace("{lid}","9");
        changeinput = t9txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t9txt,changeinput);

        item = cJSON_GetObjectItem(root,"t10");
        itemstr = cJSON_Print(item);
        String t10txt = tpl_data; 
        t10txt.replace("{lid}","10");
        changeinput = t10txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t10txt,changeinput);

        item = cJSON_GetObjectItem(root,"t11");
        itemstr = cJSON_Print(item);
        String t11txt = tpl_data; 
        t11txt.replace("{lid}","11");
        changeinput = t11txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t11txt,changeinput);

        item = cJSON_GetObjectItem(root,"t12");
        itemstr = cJSON_Print(item);
        String t12txt = tpl_data; 
        t12txt.replace("{lid}","12");
        changeinput = t12txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t12txt,changeinput);

        item = cJSON_GetObjectItem(root,"t13");
        itemstr = cJSON_Print(item);
        String t13txt = tpl_data; 
        t13txt.replace("{lid}","13");
        changeinput = t13txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t13txt,changeinput);

        item = cJSON_GetObjectItem(root,"t14");
        itemstr = cJSON_Print(item);
        String t14txt = tpl_data; 
        t14txt.replace("{lid}","14");
        changeinput = t14txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t14txt,changeinput);

        item = cJSON_GetObjectItem(root,"t15");
        itemstr = cJSON_Print(item);
        String t15txt = tpl_data; 
        t15txt.replace("{lid}","15");
        changeinput = t15txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t15txt,changeinput);

        item = cJSON_GetObjectItem(root,"t16");
        itemstr = cJSON_Print(item);
        String t16txt = tpl_data; 
        t16txt.replace("{lid}","16");
        changeinput = t16txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t16txt,changeinput);

        item = cJSON_GetObjectItem(root,"t17");
        itemstr = cJSON_Print(item);
        String t17txt = tpl_data; 
        t17txt.replace("{lid}","17");
        changeinput = t17txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t17txt,changeinput);

        item = cJSON_GetObjectItem(root,"t18");
        itemstr = cJSON_Print(item);
        String t18txt = tpl_data; 
        t18txt.replace("{lid}","18");
        changeinput = t18txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t18txt,changeinput);

        item = cJSON_GetObjectItem(root,"t19");
        itemstr = cJSON_Print(item);
        String t19txt = tpl_data; 
        t19txt.replace("{lid}","19");
        changeinput = t19txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t19txt,changeinput);

        item = cJSON_GetObjectItem(root,"t20");
        itemstr = cJSON_Print(item);
        String t20txt = tpl_data; 
        t20txt.replace("{lid}","20");
        changeinput = t20txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t20txt,changeinput);

        item = cJSON_GetObjectItem(root,"t21");
        itemstr = cJSON_Print(item);
        String t21txt = tpl_data; 
        t21txt.replace("{lid}","21");
        changeinput = t21txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t21txt,changeinput);

