chairongzhen/esp32_ledc/src/main.cpp
        item = cJSON_GetObjectItem(root,"t22");
        itemstr = cJSON_Print(item);
        String t22txt = tpl_data; 
        t22txt.replace("{lid}","22");
        changeinput = t22txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t22txt,changeinput);

        item = cJSON_GetObjectItem(root,"t23");
        itemstr = cJSON_Print(item);
        String t23txt = tpl_data; 
        t23txt.replace("{lid}","23");
        changeinput = t23txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t23txt,changeinput);

        item = cJSON_GetObjectItem(root,"t24");
        itemstr = cJSON_Print(item);
        String t24txt = tpl_data; 
        t24txt.replace("{lid}","24");
        changeinput = t24txt;
        changeinput.replace("/>","value='"+itemstr+"'/>");
        rawhtml.replace(t24txt,changeinput);
        html = html + rawhtml;
        SPIFFS.end();
      }      
    } else {
      html = html + "<p>参数错误</p>";
    }
    request->send(200,"text/html",html);
  });

  server.on("/setp",HTTP_GET,[](AsyncWebServerRequest *request){
    String lightSeq;
    String t0,t1,t2,t3,t4,t5,t6,t7,t8,t9,t10,t11,t12,t13,t14,t15,t16,t17,t18,t19,t20,t21,t22,t23,t24;
    String resfilecontent = "";
    String filename = "";
    String html;
    
    if(request->hasParam("mode")) {
      if (!SPIFFS.begin()) {
        Serial.println("SPIFFS Mount Failed");
        return;
      }
      lightSeq = request->getParam("mode")->value();
      filename = "/" + lightSeq + ".ini";
      t0 = request->getParam("t0")->value();
      t1 = request->getParam("t1")->value();
      t2 = request->getParam("t2")->value();
      t3 = request->getParam("t3")->value();
      t4 = request->getParam("t4")->value(); 
      t5 = request->getParam("t5")->value();
      t6 = request->getParam("t6")->value(); 
      t7 = request->getParam("t7")->value();
      t8 = request->getParam("t8")->value(); 
      t9 = request->getParam("t9")->value();
      t10 = request->getParam("t10")->value();
      t11 = request->getParam("t11")->value();
      t12 = request->getParam("t12")->value(); 
      t13 = request->getParam("t13")->value();
      t14 = request->getParam("t14")->value();
      t15 = request->getParam("t15")->value();
      t16 = request->getParam("t16")->value(); 
      t17 = request->getParam("t17")->value();
      t18 = request->getParam("t18")->value(); 
      t19 = request->getParam("t19")->value();
      t20 = request->getParam("t20")->value(); 
      t21 = request->getParam("t21")->value();
      t22 = request->getParam("t22")->value();
      t23 = request->getParam("t23")->value();
      t24 = request->getParam("t24")->value();

      if(lightSeq == "p1") {
        P1_0 = t0;
        P1_1 = t1;
        P1_2 = t2;
        P1_3 = t3;
        P1_4 = t4;
        P1_5 = t5;
        P1_6 = t6;
        P1_7 = t7;
        P1_8 = t8;
        P1_9 = t9;
        P1_10 = t10;
        P1_11 = t11;
        P1_12 = t12;
        P1_13 = t13;
        P1_14 = t14;
        P1_15 = t15;
        P1_16 = t16;
        P1_17 = t17;
        P1_18 = t18;
        P1_19 = t19;
        P1_20 = t20;
        P1_21 = t21;
        P1_22 = t22;
        P1_23 = t23;
        P1_24 = t24;
      } else if(lightSeq == "p2") {
        P2_0 = t0;
        P2_1 = t1;
        P2_2 = t2;
        P2_3 = t3;
        P2_4 = t4;
        P2_5 = t5;
        P2_6 = t6;
        P2_7 = t7;
        P2_8 = t8;
        P2_9 = t9;
        P2_10 = t10;
        P2_11 = t11;
        P2_12 = t12;
        P2_13 = t13;
        P2_14 = t14;
        P2_15 = t15;
        P2_16 = t16;
        P2_17 = t17;
        P2_18 = t18;
        P2_19 = t19;
        P2_20 = t20;
        P2_21 = t21;
        P2_22 = t22;
        P2_23 = t23;
        P2_24 = t24;
      } else if(lightSeq == "p3") {
         P3_0 = t0;
        P3_1 = t1;
        P3_2 = t2;
        P3_3 = t3;
        P3_4 = t4;
        P3_5 = t5;
        P3_6 = t6;
        P3_7 = t7;
        P3_8 = t8;
        P3_9 = t9;
        P3_10 = t10;
        P3_11 = t11;
        P3_12 = t12;
        P3_13 = t13;
        P3_14 = t14;
        P3_15 = t15;
        P3_16 = t16;
        P3_17 = t17;
        P3_18 = t18;
        P3_19 = t19;
        P3_20 = t20;
        P3_21 = t21;
        P3_22 = t22;
        P3_23 = t23;
        P3_24 = t24;
      } else if(lightSeq == "p4") {
         P4_0 = t0;
        P4_1 = t1;
        P4_2 = t2;
        P4_3 = t3;
        P4_4 = t4;
        P4_5 = t5;
        P4_6 = t6;
        P4_7 = t7;
        P4_8 = t8;
        P4_9 = t9;
        P4_10 = t10;
        P4_11 = t11;
        P4_12 = t12;
        P4_13 = t13;
        P4_14 = t14;
        P4_15 = t15;
        P4_16 = t16;
        P4_17 = t17;
        P4_18 = t18;
        P4_19 = t19;
        P4_20 = t20;
        P4_21 = t21;
        P4_22 = t22;
        P4_23 = t23;
        P4_24 = t24;
      } else if(lightSeq == "p5") {
         P5_0 = t0;
        P5_1 = t1;
        P5_2 = t2;
        P5_3 = t3;
        P5_4 = t4;
        P5_5 = t5;
        P5_6 = t6;
        P5_7 = t7;
        P5_8 = t8;
        P5_9 = t9;
        P5_10 = t10;
        P5_11 = t11;
        P5_12 = t12;
        P5_13 = t13;
        P5_14 = t14;
        P5_15 = t15;
        P5_16 = t16;
        P5_17 = t17;
        P5_18 = t18;
        P5_19 = t19;
        P5_20 = t20;
        P5_21 = t21;
        P5_22 = t22;
        P5_23 = t23;
        P5_24 = t24;
      } else if(lightSeq == "p6") {
         P6_0 = t0;
        P6_1 = t1;
        P6_2 = t2;
        P6_3 = t3;
        P6_4 = t4;
        P6_5 = t5;
        P6_6 = t6;
        P6_7 = t7;
        P6_8 = t8;
        P6_9 = t9;
        P6_10 = t10;
        P6_11 = t11;
        P6_12 = t12;
        P6_13 = t13;
        P6_14 = t14;
        P6_15 = t15;
        P6_16 = t16;
        P6_17 = t17;
        P6_18 = t18;
        P6_19 = t19;
        P6_20 = t20;
        P6_21 = t21;
        P6_22 = t22;
        P6_23 = t23;
        P6_24 = t24;
      } else if(lightSeq == "p7") {
         P7_0 = t0;
        P7_1 = t1;
        P7_2 = t2;
        P7_3 = t3;
        P7_4 = t4;
        P7_5 = t5;
        P7_6 = t6;
        P7_7 = t7;
        P7_8 = t8;
        P7_9 = t9;
        P7_10 = t10;
        P7_11 = t11;
        P7_12 = t12;
        P7_13 = t13;
        P7_14 = t14;
        P7_15 = t15;
        P7_16 = t16;
        P7_17 = t17;
        P7_18 = t18;
        P7_19 = t19;
        P7_20 = t20;
        P7_21 = t21;
        P7_22 = t22;
        P7_23 = t23;
        P7_24 = t24;
      }

