chairongzhen/esp32_ledc/src/main.cpp
      resfilecontent = resfilecontent + "{\"t0\":";
      resfilecontent = resfilecontent + t0;
      resfilecontent = resfilecontent + ",\"t1\":";
      resfilecontent = resfilecontent + t1;
      resfilecontent = resfilecontent + ",\"t2\":";
      resfilecontent = resfilecontent + t2;
      resfilecontent = resfilecontent + ",\"t3\":";
      resfilecontent = resfilecontent + t3;
      resfilecontent = resfilecontent + ",\"t4\":";
      resfilecontent = resfilecontent + t4;
      resfilecontent = resfilecontent + ",\"t5\":";
      resfilecontent = resfilecontent + t5;
      resfilecontent = resfilecontent + ",\"t6\":";
      resfilecontent = resfilecontent + t6;
      resfilecontent = resfilecontent + ",\"t7\":";
      resfilecontent = resfilecontent + t7;
      resfilecontent = resfilecontent + ",\"t8\":";
      resfilecontent = resfilecontent + t8;
      resfilecontent = resfilecontent + ",\"t9\":";
      resfilecontent = resfilecontent + t9;
      resfilecontent = resfilecontent + ",\"t10\":";
      resfilecontent = resfilecontent + t10;
      resfilecontent = resfilecontent + ",\"t11\":";
      resfilecontent = resfilecontent + t11;
      resfilecontent = resfilecontent + ",\"t12\":";
      resfilecontent = resfilecontent + t12;
      resfilecontent = resfilecontent + ",\"t13\":";
      resfilecontent = resfilecontent + t13;
      resfilecontent = resfilecontent + ",\"t14\":";
      resfilecontent = resfilecontent + t14;
      resfilecontent = resfilecontent + ",\"t15\":";
      resfilecontent = resfilecontent + t15;
      resfilecontent = resfilecontent + ",\"t16\":";
      resfilecontent = resfilecontent + t16;
      resfilecontent = resfilecontent + ",\"t17\":";
      resfilecontent = resfilecontent + t17;
      resfilecontent = resfilecontent + ",\"t18\":";
      resfilecontent = resfilecontent + t18;
      resfilecontent = resfilecontent + ",\"t19\":";
      resfilecontent = resfilecontent + t19;
      resfilecontent = resfilecontent + ",\"t20\":";
      resfilecontent = resfilecontent + t20;
      resfilecontent = resfilecontent + ",\"t21\":";
      resfilecontent = resfilecontent + t21;
      resfilecontent = resfilecontent + ",\"t22\":";
      resfilecontent = resfilecontent + t22;
      resfilecontent = resfilecontent + ",\"t23\":";
      resfilecontent = resfilecontent + t23;
      resfilecontent = resfilecontent + ",\"t24\":";
      resfilecontent = resfilecontent + t24 + "}";
      writeFile(SPIFFS,filename.c_str(),resfilecontent.c_str());
      SPIFFS.end();

    } else {
      html = "params not found";
    }
    request->redirect("/p?mode="+lightSeq);
  });

  server.on("/pwmopr",HTTP_GET,[](AsyncWebServerRequest *request) {
    String showtype;
    String testmode;
    String sysdate;
    String conmode;
    if(request->hasParam("showtype")) {
      if (!SPIFFS.begin()) {
        Serial.println("SPIFFS Mount Failed");
        return;
      }
      showtype = request->getParam("showtype")->value();
      testmode = request->getParam("testmode")->value();
      sysdate = request->getParam("sysdate")->value();
      conmode = request->getParam("conmode")->value();

      PWM_INFO_SHOWTYPE = showtype;
      PWM_INFO_TESTMODE = testmode;
      PWM_INFO_CONMODE = conmode;

      String filecontent;
      filecontent = "{\"showtype\":\"";
      filecontent = filecontent + showtype;
      filecontent = filecontent + "\",\"testmode\":\"";
      filecontent = filecontent + testmode;
      filecontent = filecontent + "\",\"sysdate\":\"";
      filecontent = filecontent + sysdate;
      filecontent = filecontent + "\",\"conmode\":\"";
      filecontent = filecontent + conmode;
      filecontent = filecontent + "\"}";
      PWM_INFO_RTC = sysdate;

      struct timeval stime;  
      stime.tv_sec = PWM_INFO_RTC.toInt();
      settimeofday(&stime,NULL);
      Serial.println("the new time is: " + PWM_INFO_RTC);  
      writeFile(SPIFFS,"/pwminfo.ini",filecontent.c_str());
      SPIFFS.end();
    }
    request->redirect("/");
  });

  server.on("/init",HTTP_GET,[](AsyncWebServerRequest *request) {
    if (!SPIFFS.begin()) {
      Serial.println("SPIFFS Mount Failed");
      return;
    }
    Serial.println("init start.........................");
    initFileSystem();
    Serial.println("init success.........................");
    SPIFFS.end();
    request->redirect("/");    
  });

  server.on("/wifi",HTTP_GET,[](AsyncWebServerRequest *request) {
    String rawhtml = "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"UTF-8\"><title>WiFi Setup Page</title></head><body><div><h1 id=\"title\">联网设置</h1><table><tr><th style=\"text-align:left;\">WIFI名称</th></tr><tr><td><input type=\"text\"id=\"txtssid\"/></td></tr><tr><th style=\"text-align:left;\">WIFI密码</th></tr><tr><td><input type=\"text\"id=\"txtpwd\"/></td></tr><tr><td><input type=\"submit\"value=\"连接\"id=\"btnConnect\"onclick=\"submit()\"/><input type=\"button\"value=\"返回\"id=\"btnBack\"onclick=\"back()\"/></td></tr><tr><td><span id=\"spResult\"></span></td></tr></table><hr/><h1 id=\"title\">WIFI热点扫描</h1><table id=\"wifilist\"></table></div><script>function submit(){var ssid=document.getElementById('txtssid').value;var pwd=document.getElementById('txtpwd').value;alert(\"正在连接热点,请关闭此页面并切换选择的热点，通过http://esp32访问\");var url=\"savewifi?ssid=\"+ssid+\"&pwd=\"+pwd;window.location.href=url}function back(){var url=\"/\";window.location.href=url}</script></body></html>";
    if (!SPIFFS.begin()) {
      Serial.println("SPIFFS Mount Failed");
      return;
    }
    if(SPIFFS.exists("/wifi.ini")) {      
      String filestr;
      filestr = getFileString(SPIFFS,"/wifi.ini");
      cJSON* root = NULL;
      cJSON* item = NULL;
      const char* jsonstr = filestr.c_str();
      root = cJSON_Parse(jsonstr);
      String itemstr;
      item = cJSON_GetObjectItem(root,"ssid");
      itemstr = cJSON_Print(item);
      String ssid = itemstr;
      item = cJSON_GetObjectItem(root,"pwd");
      itemstr = cJSON_Print(item);
      String pwd = itemstr;

      String tpl_ssid = "<input type=\"text\"id=\"txtssid\"/>";
      String tpl_pwd = "<input type=\"text\"id=\"txtpwd\"/>";
      String change_ssid = "<input type=\"text\"id=\"txtssid\" value=";
      change_ssid = change_ssid + ssid;
      change_ssid = change_ssid + "/>";
      String change_pwd = "<input type=\"text\"id=\"txtpwd\" value=";
      change_pwd = change_pwd + pwd;
      change_pwd = change_pwd + "/>";
      rawhtml.replace(tpl_ssid,change_ssid);
      rawhtml.replace(tpl_pwd,change_pwd);
    }
    SPIFFS.end();
    
    String tpl_scanresult = "<table id=\"wifilist\"></table>";
    String change_scanresult = "";
    int n = WiFi.scanNetworks();
    if(n==0) {
      change_scanresult = "<table id=\"wifilist\"><tr><td>wifi not found</td></tr></table>";
      rawhtml.replace(tpl_scanresult,change_scanresult);
    } else {      
      String change_scanresult = "<table id=\"wifilist\">";
      for(int i=0;i<n;++i) {
        change_scanresult = change_scanresult + "<tr><td>";
        change_scanresult = change_scanresult +  WiFi.SSID(i);
        change_scanresult = change_scanresult +  "</td></tr>";
      }
      change_scanresult = change_scanresult + "</table>";
      rawhtml.replace(tpl_scanresult,change_scanresult);
    }
    
    request->send(200,"text/html",rawhtml);
  });

  server.on("/savewifi",HTTP_GET,[](AsyncWebServerRequest *request) {
    if(request->hasParam("ssid")) { 
      if (!SPIFFS.begin()) {
        Serial.println("SPIFFS Mount Failed");
        return;
      }
      String ssid = request->getParam("ssid")->value();
      String pwd = request->getParam("pwd")->value();
      String filecontent;
      filecontent = filecontent + "{\"ssid\":\"";
      filecontent = filecontent + ssid;
      filecontent = filecontent + "\",\"pwd\":\"";
      filecontent = filecontent + pwd;
      filecontent = filecontent + "\"}";
      writeFile(SPIFFS,"/wifi.ini",filecontent.c_str());
      SPIFFS.end();
      Serial.println("Begin to reboot!");
      ESP.restart();
    } else {
      Serial.println("param error");

