chairongzhen/esp32_ledc/src/main.cpp
    }
    request->redirect("/");
    
  });

  server.on("/reset",HTTP_GET,[](AsyncWebServerRequest *request){
    Serial.println("Start to reset....");
    ESP.restart();
  });

  server.on("/upload",HTTP_GET,[](AsyncWebServerRequest *request){
    String html = "<!DOCTYPE html><html lang=\"en\"><head><meta charset=\"UTF-8\"><title>Update System</title><script src='https://apps.bdimg.com/libs/jquery/2.1.4/jquery.min.js'></script></head><body><div><h1 id=\"title\">更新固件</h1><hr/><form method='POST'action='#'enctype='multipart/form-data'id='upload_form'><input type='file'name='update'/><input type='submit'value='更新'/></form><div id='prg'>progress:0%</div></div><script>$('form').submit(function(e){e.preventDefault();var form=$('#upload_form')[0];var data=new FormData(form);$.ajax({url:'/update',type:'POST',data:data,contentType:false,processData:false,xhr:function(){var xhr=new window.XMLHttpRequest();xhr.upload.addEventListener('progress',function(evt){if(evt.lengthComputable){var per=evt.loaded/evt.total;$('#prg').html('progress: '+Math.round(per*100)+'%')}},false);return xhr},success:function(d,s){console.log('success!')},error:function(a,b,c){}})});</script></body></html>";
    request->send(200,"text/html",html);
  });

  server.on("/update",HTTP_POST,[](AsyncWebServerRequest *request){
    if (!SPIFFS.begin()) {
      Serial.println("SPIFFS Mount Failed");
      return;
    }
    String pwminfocontent = "{\"showtype\":\"fix\",\"testmode\":\"test\",\"sysdate\":\"{unixtick}\",\"status\":\"stop\",\"conmode\": \"local\",\"version\":\"{version_num}\"}";
    pwminfocontent.replace("{version_num}",VERSION_NUM);
    pwminfocontent.replace("{unixtick}",String(ESP_RTC_TICK));
    writeFile(SPIFFS,"/pwminfo.ini",pwminfocontent.c_str());
    SPIFFS.end();
    ESP.restart();
  },onFileUpload);  

  server.onNotFound(notFound);
  server.begin();
  
}


void loop() {        
  if(RESET_FLAG) {
    Serial.println("Start to initialize the system configuration.");
    if (!SPIFFS.begin()) {
      Serial.println("SPIFFS Mount Failed");
      return;
    }
    initFileSystem();
    SPIFFS.end();
    RESET_FLAG = false;
    ESP.restart();
  }
  time_t t = time(NULL); 
  struct tm *t_st;
  t_st = localtime(&t);
  int currenthour = t_st->tm_hour;
  int currentsec = t_st->tm_sec;
  if(PWM_INFO_CONMODE == "online") {
      Serial.println("connection to the cloud....");
      led1.set(0);
      led2.set(0);
      led3.set(0);
      led4.set(0);
      led5.set(0);
      led6.set(0);
      led7.set(0);
    } else if(PWM_INFO_CONMODE == "local") {
        if(PWM_INFO_SHOWTYPE == "repeat") {
          
          if(PWM_INFO_TESTMODE == "production") {
            log_printf("product mode .... current hour is: %d \n",currenthour);            
            if(currenthour == 0) {
              led1.set(P1_0.toInt());
              led2.set(P2_0.toInt());
              led3.set(P3_0.toInt());
              led4.set(P4_0.toInt());
              led5.set(P5_0.toInt());
              led6.set(P6_0.toInt());
              led7.set(P7_0.toInt());
            } else if(currenthour == 1) {
              led1.set(P1_1.toInt());
              led2.set(P2_1.toInt());
              led3.set(P3_1.toInt());
              led4.set(P4_1.toInt());
              led5.set(P5_1.toInt());
              led6.set(P6_1.toInt());
              led7.set(P7_1.toInt());
            } else if(currenthour == 2) {
              led1.set(P1_2.toInt());
              led2.set(P2_2.toInt());
              led3.set(P3_2.toInt());
              led4.set(P4_2.toInt());
              led5.set(P5_2.toInt());
              led6.set(P6_2.toInt());
              led7.set(P7_2.toInt());
            } else if(currenthour == 3) {
              led1.set(P1_3.toInt());
              led2.set(P2_3.toInt());
              led3.set(P3_3.toInt());
              led4.set(P4_3.toInt());
              led5.set(P5_3.toInt());
              led6.set(P6_3.toInt());
              led7.set(P7_3.toInt());
            } else if(currenthour == 4) {
              led1.set(P1_4.toInt());
              led2.set(P2_4.toInt());
              led3.set(P3_4.toInt());
              led4.set(P4_4.toInt());
              led5.set(P5_4.toInt());
              led6.set(P6_4.toInt());
              led7.set(P7_4.toInt());
            } else if(currenthour == 5) {
              led1.set(P1_5.toInt());
              led2.set(P2_5.toInt());
              led3.set(P3_5.toInt());
              led4.set(P4_5.toInt());
              led5.set(P5_5.toInt());
              led6.set(P6_5.toInt());
              led7.set(P7_5.toInt());
            } else if(currenthour == 6) {
              led1.set(P1_6.toInt());
              led2.set(P2_6.toInt());
              led3.set(P3_6.toInt());
              led4.set(P4_6.toInt());
              led5.set(P5_6.toInt());
              led6.set(P6_6.toInt());
              led7.set(P7_6.toInt());
            } else if(currenthour == 7) {
              led1.set(P1_7.toInt());
              led2.set(P2_7.toInt());
              led3.set(P3_7.toInt());
              led4.set(P4_7.toInt());
              led5.set(P5_7.toInt());
              led6.set(P6_7.toInt());
              led7.set(P7_7.toInt());
            } else if(currenthour == 8) {
              led1.set(P1_8.toInt());
              led2.set(P2_8.toInt());
              led3.set(P3_8.toInt());
              led4.set(P4_8.toInt());
              led5.set(P5_8.toInt());
              led6.set(P6_8.toInt());
              led7.set(P7_8.toInt());
            } else if(currenthour == 9) {
              led1.set(P1_9.toInt());
              led2.set(P2_9.toInt());
              led3.set(P3_9.toInt());
              led4.set(P4_9.toInt());
              led5.set(P5_9.toInt());
              led6.set(P6_9.toInt());
              led7.set(P7_9.toInt());
            } else if(currenthour == 10) {
              led1.set(P1_10.toInt());
              led2.set(P2_10.toInt());
              led3.set(P3_10.toInt());
              led4.set(P4_10.toInt());
              led5.set(P5_10.toInt());
              led6.set(P6_10.toInt());
              led7.set(P7_10.toInt());
            } else if(currenthour == 11) {
              led1.set(P1_11.toInt());
              led2.set(P2_11.toInt());
              led3.set(P3_11.toInt());
              led4.set(P4_11.toInt());
              led5.set(P5_11.toInt());
              led6.set(P6_11.toInt());
              led7.set(P7_11.toInt());
            } else if(currenthour == 12) {
              led1.set(P1_12.toInt());
              led2.set(P2_12.toInt());
              led3.set(P3_12.toInt());
              led4.set(P4_12.toInt());
              led5.set(P5_12.toInt());
              led6.set(P6_12.toInt());
              led7.set(P7_12.toInt());
            } else if(currenthour == 13) {
              led1.set(P1_13.toInt());
              led2.set(P2_13.toInt());
              led3.set(P3_13.toInt());
              led4.set(P4_13.toInt());
              led5.set(P5_13.toInt());
              led6.set(P6_13.toInt());
              led7.set(P7_13.toInt());
            } else if(currenthour == 14) {
              led1.set(P1_14.toInt());
              led2.set(P2_14.toInt());
              led3.set(P3_14.toInt());
              led4.set(P4_14.toInt());
              led5.set(P5_14.toInt());
              led6.set(P6_14.toInt());
              led7.set(P7_14.toInt());
            } else if(currenthour == 15) {
              led1.set(P1_15.toInt());
              led2.set(P2_15.toInt());
              led3.set(P3_15.toInt());
              led4.set(P4_15.toInt());
              led5.set(P5_15.toInt());
              led6.set(P6_15.toInt());
              led7.set(P7_15.toInt());
            } else if(currenthour == 16) {
              led1.set(P1_16.toInt());
              led2.set(P2_16.toInt());
              led3.set(P3_16.toInt());
              led4.set(P4_16.toInt());
              led5.set(P5_16.toInt());
              led6.set(P6_16.toInt());
              led7.set(P7_16.toInt());
            } else if(currenthour == 17) {
              led1.set(P1_17.toInt());
              led2.set(P2_17.toInt());
              led3.set(P3_17.toInt());
              led4.set(P4_17.toInt());
              led5.set(P5_17.toInt());
              led6.set(P6_17.toInt());
              led7.set(P7_17.toInt());
            } else if(currenthour == 18) {
              led1.set(P1_18.toInt());
              led2.set(P2_18.toInt());
              led3.set(P3_18.toInt());
              led4.set(P4_18.toInt());
              led5.set(P5_18.toInt());
              led6.set(P6_18.toInt());
              led7.set(P7_18.toInt());
            } else if(currenthour == 19) {
              led1.set(P1_19.toInt());
              led2.set(P2_19.toInt());
              led3.set(P3_19.toInt());
              led4.set(P4_19.toInt());
              led5.set(P5_19.toInt());
              led6.set(P6_19.toInt());
              led7.set(P7_19.toInt());
            } else if(currenthour == 20) {
              led1.set(P1_20.toInt());
              led2.set(P2_20.toInt());
              led3.set(P3_20.toInt());
              led4.set(P4_20.toInt());
              led5.set(P5_20.toInt());
              led6.set(P6_20.toInt());
              led7.set(P7_20.toInt());
            } else if(currenthour == 21) {
              led1.set(P1_21.toInt());
              led2.set(P2_21.toInt());
              led3.set(P3_21.toInt());
              led4.set(P4_21.toInt());
              led5.set(P5_21.toInt());
              led6.set(P6_21.toInt());
              led7.set(P7_21.toInt());
            } else if(currenthour == 22) {
              led1.set(P1_22.toInt());
              led2.set(P2_22.toInt());
              led3.set(P3_22.toInt());
              led4.set(P4_22.toInt());
              led5.set(P5_22.toInt());
              led6.set(P6_22.toInt());
              led7.set(P7_22.toInt());
            } else if(currenthour == 23) {
              led1.set(P1_23.toInt());
              led2.set(P2_23.toInt());
              led3.set(P3_23.toInt());
              led4.set(P4_23.toInt());
              led5.set(P5_23.toInt());
              led6.set(P6_23.toInt());
              led7.set(P7_23.toInt());
            }
          } else if(PWM_INFO_TESTMODE == "test") {
            
            log_printf("test mode .... current sec is: %d \n",currentsec);
            
            if(currentsec == 0 || currentsec == 30 ) {
              led1.set(P1_0.toInt());
              led2.set(P2_0.toInt());
              led3.set(P3_0.toInt());
              led4.set(P4_0.toInt());
              led5.set(P5_0.toInt());
              led6.set(P6_0.toInt());
              led7.set(P7_0.toInt());
            } else if(currentsec == 1 || currentsec == 31) {
              led1.set(P1_1.toInt());
              led2.set(P2_1.toInt());
              led3.set(P3_1.toInt());
              led4.set(P4_1.toInt());
              led5.set(P5_1.toInt());
              led6.set(P6_1.toInt());
              led7.set(P7_1.toInt());
            } else if(currentsec == 2 || currentsec == 32) {
              led1.set(P1_2.toInt());
              led2.set(P2_2.toInt());
              led3.set(P3_2.toInt());
              led4.set(P4_2.toInt());
              led5.set(P5_2.toInt());
              led6.set(P6_2.toInt());
              led7.set(P7_2.toInt());
            } else if(currentsec == 3 || currentsec == 33) {
              led1.set(P1_3.toInt());
              led2.set(P2_3.toInt());
              led3.set(P3_3.toInt());
              led4.set(P4_3.toInt());
              led5.set(P5_3.toInt());
              led6.set(P6_3.toInt());
              led7.set(P7_3.toInt());
            } else if(currentsec == 4 || currentsec == 34) {
              led1.set(P1_4.toInt());
              led2.set(P2_4.toInt());
              led3.set(P3_4.toInt());
              led4.set(P4_4.toInt());
              led5.set(P5_4.toInt());
              led6.set(P6_4.toInt());
              led7.set(P7_4.toInt());
            } else if(currentsec == 5 || currentsec == 35) {
              led1.set(P1_5.toInt());
              led2.set(P2_5.toInt());
              led3.set(P3_5.toInt());
              led4.set(P4_5.toInt());
              led5.set(P5_5.toInt());
              led6.set(P6_5.toInt());
              led7.set(P7_5.toInt());
            } else if(currentsec == 6 || currentsec == 36) {
              led1.set(P1_6.toInt());
              led2.set(P2_6.toInt());
              led3.set(P3_6.toInt());
              led4.set(P4_6.toInt());
              led5.set(P5_6.toInt());
              led6.set(P6_6.toInt());
              led7.set(P7_6.toInt());
            } else if(currentsec == 7 || currentsec == 37) {
              led1.set(P1_7.toInt());
              led2.set(P2_7.toInt());
              led3.set(P3_7.toInt());
              led4.set(P4_7.toInt());
              led5.set(P5_7.toInt());
              led6.set(P6_7.toInt());
              led7.set(P7_7.toInt());
            } else if(currentsec == 8 || currentsec == 38) {
              led1.set(P1_8.toInt());
              led2.set(P2_8.toInt());
              led3.set(P3_8.toInt());
              led4.set(P4_8.toInt());
              led5.set(P5_8.toInt());
              led6.set(P6_8.toInt());
              led7.set(P7_8.toInt());
            } else if(currentsec == 9 || currentsec == 39) {
              led1.set(P1_9.toInt());
              led2.set(P2_9.toInt());
              led3.set(P3_9.toInt());
              led4.set(P4_9.toInt());
              led5.set(P5_9.toInt());
              led6.set(P6_9.toInt());
              led7.set(P7_9.toInt());
            } else if(currentsec == 10 || currentsec == 40) {
              led1.set(P1_10.toInt());
              led2.set(P2_10.toInt());
              led3.set(P3_10.toInt());
              led4.set(P4_10.toInt());
              led5.set(P5_10.toInt());
              led6.set(P6_10.toInt());
              led7.set(P7_10.toInt());
            } else if(currentsec == 11 || currentsec == 41) {
              led1.set(P1_11.toInt());
              led2.set(P2_11.toInt());
              led3.set(P3_11.toInt());
              led4.set(P4_11.toInt());
              led5.set(P5_11.toInt());
              led6.set(P6_11.toInt());
              led7.set(P7_11.toInt());
            } else if(currentsec == 12 || currentsec == 42) {
              led1.set(P1_12.toInt());
              led2.set(P2_12.toInt());
              led3.set(P3_12.toInt());
              led4.set(P4_12.toInt());
              led5.set(P5_12.toInt());
              led6.set(P6_12.toInt());
              led7.set(P7_12.toInt());
            } else if(currentsec == 13 || currentsec == 43) {
              led1.set(P1_13.toInt());
              led2.set(P2_13.toInt());
              led3.set(P3_13.toInt());
              led4.set(P4_13.toInt());
              led5.set(P5_13.toInt());
              led6.set(P6_13.toInt());
              led7.set(P7_13.toInt());
            } else if(currentsec == 14 || currentsec == 44) {
              led1.set(P1_14.toInt());
              led2.set(P2_14.toInt());
              led3.set(P3_14.toInt());
              led4.set(P4_14.toInt());
              led5.set(P5_14.toInt());
              led6.set(P6_14.toInt());
              led7.set(P7_14.toInt());
            } else if(currentsec == 15 || currentsec == 45) {
              led1.set(P1_15.toInt());
              led2.set(P2_15.toInt());
              led3.set(P3_15.toInt());
              led4.set(P4_15.toInt());
              led5.set(P5_15.toInt());
              led6.set(P6_15.toInt());
              led7.set(P7_15.toInt());
            } else if(currentsec == 16 || currentsec == 46) {
              led1.set(P1_16.toInt());
              led2.set(P2_16.toInt());
              led3.set(P3_16.toInt());
              led4.set(P4_16.toInt());
              led5.set(P5_16.toInt());
              led6.set(P6_16.toInt());
              led7.set(P7_16.toInt());
            } else if(currentsec == 17 || currentsec == 47) {
              led1.set(P1_17.toInt());
              led2.set(P2_17.toInt());
              led3.set(P3_17.toInt());
              led4.set(P4_17.toInt());
              led5.set(P5_17.toInt());
              led6.set(P6_17.toInt());
              led7.set(P7_17.toInt());
            } else if(currentsec == 18 || currentsec == 48) {
              led1.set(P1_18.toInt());
              led2.set(P2_18.toInt());
              led3.set(P3_18.toInt());
              led4.set(P4_18.toInt());
              led5.set(P5_18.toInt());
              led6.set(P6_18.toInt());
              led7.set(P7_18.toInt());
            } else if(currentsec == 19 || currentsec == 49) {
              led1.set(P1_19.toInt());
              led2.set(P2_19.toInt());
              led3.set(P3_19.toInt());
              led4.set(P4_19.toInt());
              led5.set(P5_19.toInt());
              led6.set(P6_19.toInt());
              led7.set(P7_19.toInt());
            } else if(currentsec == 20 || currentsec == 50) {
              led1.set(P1_20.toInt());
              led2.set(P2_20.toInt());
              led3.set(P3_20.toInt());
              led4.set(P4_20.toInt());
              led5.set(P5_20.toInt());
              led6.set(P6_20.toInt());
              led7.set(P7_20.toInt());
            } else if(currentsec == 21 || currentsec == 51) {
              led1.set(P1_21.toInt());
              led2.set(P2_21.toInt());
              led3.set(P3_21.toInt());
              led4.set(P4_21.toInt());
              led5.set(P5_21.toInt());
              led6.set(P6_21.toInt());
              led7.set(P7_21.toInt());
            } else if(currentsec == 22 || currentsec == 52) {
              led1.set(P1_22.toInt());
              led2.set(P2_22.toInt());
              led3.set(P3_22.toInt());
              led4.set(P4_22.toInt());
              led5.set(P5_22.toInt());
              led6.set(P6_22.toInt());
              led7.set(P7_22.toInt());
            } else if(currentsec == 23 || currentsec == 53) {
              led1.set(P1_23.toInt());
              led2.set(P2_23.toInt());
              led3.set(P3_23.toInt());
              led4.set(P4_23.toInt());
              led5.set(P5_23.toInt());
              led6.set(P6_23.toInt());
              led7.set(P7_23.toInt());
            }

          }
        } else if(PWM_INFO_SHOWTYPE == "fix") {
          //Serial.println(" this is the fix mode");
          led1.set(P1_24.toInt());
          led2.set(P2_24.toInt());
          led3.set(P3_24.toInt());
          led4.set(P4_24.toInt());
          led5.set(P5_24.toInt());
          led6.set(P6_24.toInt());
          led7.set(P7_24.toInt());
          //Serial.println("....let7: " +P7_24);
          //led7.set(255);
        }
    }
    delay(1000);
}